Тест/Тест/src/Documents/ЗаявкаЗакупкаТовара/ЗаявкаЗакупкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаЗакупкаТовара</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявкаЗакупкаТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакупленныйТовар</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производитель</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВЗаказНаряде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Documents/ЗаявкаЗакупкаТовара/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
//	ДокСсылка = ПриОткрытииНаСервере();
//	
//	Если ДокСсылка <> 0 Тогда
//		Отказ = Истина;
//		СсылкаНаЭлементСправочника = ДокСсылка;
//		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлементСправочника);
//		ОткрытьФорму("Документ.ЗаявкаЗакупкаТовара.Форма.ФормаДокумента", ПараметрыФормы);
//		//ОткрытьЗначение(ДокСсылка);     
//	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Функция ПриОткрытииНаСервере()
//	Если  НЕ РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
//		Возврат 0; //открывается уже существующий док
//	Иначе    
//		Запрос = Новый Запрос;
//		Запрос.Текст =  "ВЫБРАТЬ
//		|	ЗаявкаЗакупкаТовара.Ссылка КАК Ссылка
//		|ИЗ
//		|	Документ.ЗаявкаЗакупкаТовара КАК ЗаявкаЗакупкаТовара
//		|ГДЕ
//		|	ЗаявкаЗакупкаТовара.Основание = &Основание";
//		
//		Запрос.УстановитьПараметр("Основание", Объект.Основание);
//		Результат = Запрос.Выполнить();
//		Если Результат.Пустой() Тогда
//			Возврат 0; // документа нет
//		Иначе
//			Выборка = Результат.Выбрать();
//			Выборка.Следующий();
//			Возврат Выборка.Ссылка; //Возвращаем ссылку на существующий док
//		КонецЕсли;
//	КонецЕсли;
КонецФункции

&НаСервере
Функция ОбновитьСуммуДокумента()
	Объект.СуммаДокумента = Объект.ЗакупленныйТовар.Итог("Сумма")
КонецФункции

&НаКлиенте
Процедура ЗакупленныйТоварПриИзменении(Элемент)
	ОбновитьСуммуДокумента(); 
КонецПроцедуры

Функция ПолучитьСсылкуНаЗаявкаНаЗакупку()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаЗакупкаТовара.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаЗакупкаТовара КАК ЗаявкаЗакупкаТовара
		|ГДЕ
		|	ЗаявкаЗакупкаТовара.ЗаказНаряд = &ЗаказНаряд
		|	И ЗаявкаЗакупкаТовара.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ЗаказНаряд", Объект.Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если 	РезультатЗапроса.Пустой() Тогда
			СсылкаЗаявкаНаЗакупку = Неопределено;
	Иначе 	
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СсылкаЗаявкаНаЗакупку = Выборка.Ссылка; 
	КонецЕсли; 
	
	Возврат СсылкаЗаявкаНаЗакупку; 
	
КонецФункции
